--- a/application/README.md
+++ b/application/README.md
@@ -39,225 +39,168 @@ With a paired fob and computer connected as shown below, sending `enable <BIN>\n
-
 #### Main flowchart
 
+```plantuml
+@startuml
+start
+repeat
+  if (Rec'd HOST command?) then (yes)
+    :processHostCommand();
+  endif
+  if (Paired?) then (yes)
+    if (Button pressed?) then (yes)
+      :attemptUnlock();
+    endif
+  else (no)
+    if (Rec'd data on BOARD UART?) then (yes)
+      :receivePairData();
+    endif
+  endif
+repeat while (true)
+stop
+@enduml
 ```
-┌───────────┐                                                                                                       
-│           │                                                        processHostCommand()                           
-│           ▼                                                       ┌──────────────────────────────────────────────┐
-│   ┏ ━ ━ ━ ━ ━ ━ ━ ┓ Y                                             │ ┏ ━ ━ ━ ━ ━ ━ ━ ┓  Y  ┌───────────────┐      │
-│      Rec'd HOST    ───────────────────────────────────────────────┼▶ cmd == enable?  ────▶│enableFeature()│───┐  │
-│   ┃   command?    ┃                                               │ ┃               ┃     │               │   │  │
-│    ━ ━ ━ ━ ━ ━ ━ ━                                                │  ━ ━ ━ ━ ━ ━ ━ ━      └───────────────┘   │  │
-│         N │                                                       │       N │                                 │  │
-│           │                                                       │         │                                 │  │
-│           ▼                                                       │         ▼                                 │  │
-│   ┏ ━ ━ ━ ━ ━ ━ ━ ┓  Y  ┏ ━ ━ ━ ━ ━ ━ ━ ┓  Y  ┌───────────────┐   │ ┏ ━ ━ ━ ━ ━ ━ ━ ┓  Y  ┌───────────────┐   │  │
-│        Paired?     ────▶  Btn pressed?   ────▶│attemptUnlock()│   │   cmd == pair?   ────▶│   pairFob()   ├───┤  │
-│   ┃               ┃     ┃               ┃     │               │   │ ┃               ┃     │               │   │  │
-│    ━ ━ ━ ━ ━ ━ ━ ━       ━ ━ ━ ━ ━ ━ ━ ━      └───────────────┘   │  ━ ━ ━ ━ ━ ━ ━ ━      └───────────────┘   │  │
-│         N │                   N │                     │           │       N │                                 │  │
-│           │                     └─────────────────────┤           │         │                                 │  │
-│           ▼                                           │           │         ▼                                 │  │
-│   ┌ ─ ─ ─ ─ ─ ─ ─ ┐  Y  ┌───────────────┐             │           │ ┌───────────────┐                         │  │
-│      Rec'd c on    ────▶│receivePairData│             │           │ │ (other cmds)  ├─────────────────────────┤  │
-│   │  BOARD UART?  │     │      ()       │             │           │ │               │                         │  │
-│    ─ ─ ─ ─ ─ ─ ─ ─      └───────┬───────┘             │           │ └───────────────┘                         │  │
-│         N │                     │                     │           └───────────────────────────────────────────┼──┘
-└───────────┴─────────────────────┴─────────────────────┴───────────────────────────────────────────────────────┘   
@@
 ```
 
 #### Flowchart for enableFeature()
 
@@
 
 #### Flowchart for attemptUnlock()
 
-```
-┌ ─ ─ ─ ─ ─ ─ ─ ┐ N    
-     paired?     ─────┐
-│               │     │
- ─ ─ ─ ─ ─ ─ ─ ─      │
-      Y │             │
-        ▼             │
-┌───────────────┐     │
-│Send unlock msg│     │
-│               │     │
-└───────────────┘     │
-        │             │
-        ▼             │
-┌ ─ ─ ─ ─ ─ ─ ─ ┐ N   │
-      Rec'd      ─────┤
-│ ACK_SUCCESS?  │     │
- ─ ─ ─ ─ ─ ─ ─ ─      │
-      Y │             │
-        ▼             │
-┌───────────────┐     │
-│Send start msg │     │
-│               │     │
-└───────────────┘     │
-        │             │
-        ├─────────────┘
-        │              
-        ▼              
+```plantuml
+@startuml
+start
+if (Paired?) then (no)
+  stop
+else (yes)
+endif
+:Send UNLOCK MSG;
+:Receive NONCE MSG;
+:Compute AES-CMAC(nonce);
+:Send RESPONSE MSG;
+if (Rec'd ACK_SUCCESS?) then (yes)
+  :Send START MSG;
+else (no)
+endif
+stop
+@enduml
 ```
 
 ### Car
 
-Flowcharts made with [Monosketch.io](https://monosketch.io/)
-
 #### Main flowchart
 
-```
-┌───────────┐                                   
-│           │                                   
-│           ▼                                   
-│   ┏ ━ ━ ━ ━ ━ ━ ━ ┓ Y   ┌───────────────┐     
-│      Rec'd HOST    ────▶│  processHost  │────┐
-│   ┃   command?    ┃     │   Command()   │    │
-│    ━ ━ ━ ━ ━ ━ ━ ━      └───────────────┘    │
-│         N │                                  │
-│           │                                  │
-│           ▼                                  │
-│   ┌ ─ ─ ─ ─ ─ ─ ─ ┐  Y  ┌───────────────┐    │
-│      Rec'd c on    ────▶│  unlockCar()  │    │
-│   │  BOARD UART?  │     │               │    │
-│    ─ ─ ─ ─ ─ ─ ─ ─      └───────┬───────┘    │
-│         N │                     │            │
-└───────────┴─────────────────────┴────────────┘
+```plantuml
+@startuml
+start
+repeat
+  if (Rec'd HOST command?) then (yes)
+    :processHostCommand();
+  endif
+  if (Rec'd data on BOARD UART?) then (yes)
+    :unlockCar();
+  endif
+repeat while (true)
+stop
+@enduml
 ```
 
 #### Flowchart for unlockCar()
 
-```
-┌───────────────┐      
-│Receive unlock │      
-│      msg      │      
-└───────────────┘      
-        │              
-        ▼  
-┌───────────────┐      
-│  Compute MAC  │      
-│               │      
-└───────────────┘      
-        │              
-        ▼             
-┏ ━ ━ ━ ━ ━ ━ ━ ┓ N    
-  Computed MAC   ─────┐
-┃ == Rec'd MAC? ┃     │
- ━ ━ ━ ━ ━ ━ ━ ━      │
-      Y │             │
-        ▼             │
-┏ ━ ━ ━ ━ ━ ━ ━ ┓ N   │
-  Rec'd counter  ─────┤
-┃ within WINDOW?┃     │
- ━ ━ ━ ━ ━ ━ ━ ━      │
-      Y │             │
-        ▼             │
-┌───────────────┐     │
-│Emit unlock flag     │
-│Send ACK_SUCCESS     │
-└───────────────┘     │
-        │             │
-        ▼             │
-┌───────────────┐     │
-│ Receive start │     │
-│      msg      │     │
-└───────────────┘     │
-        │             │
-        ▼             │
-┏ ━ ━ ━ ━ ━ ━ ━ ┓ N   │
-  car IDs same?  ─────┤
-┃               ┃     │
- ━ ━ ━ ━ ━ ━ ━ ━      │
-      Y │             │
-        ▼             │
-┌───────────────┐     │
-│ Emit feature  │     │
-│    flags      │     │
-└───────────────┘     │
-        │             │
-        ├─────────────┘
-        │              
-        ▼              
+```plantuml
+@startuml
+start
+:Receive UNLOCK MSG;
+:Generate nonce (CTR-DRBG);
+:Send NONCE MSG;
+:Compute AES-CMAC(nonce);
+:Receive RESPONSE MSG;
+if (Computed MAC == Rec'd MAC?) then (yes)
+  :Emit unlock flag;
+  :Send ACK_SUCCESS;
+  :Receive START MSG;
+  if (Car IDs match?) then (yes)
+    :Emit feature flags;
+  else (no)
+  endif
+else (no)
+  :Send ACK_FAILURE;
+endif
+stop
+@enduml
 ```
 
 ### Unlock sequence diagram
